<?php
require('ppframe.php');

//echo '<pre>';
//$str = <<<EOT
//a:3:{i:1;a:2:{i:129;a:9:{s:5:"title";s:21:"<p>阿斯蒂芬撒旦法</p>";s:3:"dsp";s:0:"";s:2:"xx";a:4:{i:0;a:2:{s:2:"xx";s:6:"艾丝凡";s:1:"k";s:1:"2";}i:1;a:2:{s:2:"xx";s:8:"爱上对方";s:1:"k";s:1:"3";}i:2;a:2:{s:2:"xx";s:6:"撒旦法";s:1:"k";s:1:"1";}i:3;a:2:{s:2:"xx";s:6:"埃弗顿";s:1:"k";s:1:"4";}}s:4:"daan";s:1:"2";s:5:"jieda";s:0:"";s:3:"fen";s:1:"2";s:2:"kf";s:1:"0";s:1:"k";s:3:"129";s:2:"th";s:1:"1";}i:130;a:9:{s:5:"title";s:8:"测试看看";s:3:"dsp";s:0:"";s:2:"xx";a:4:{i:0;a:2:{s:2:"xx";s:1:"\";s:1:"k";s:1:"1";}i:1;a:2:{s:2:"xx";s:23:"阿罗迪克asdfa';;l'hl/a/";s:1:"k";s:1:"3";}i:2;a:2:{s:2:"xx";s:11:"->埃保常adf";s:1:"k";s:1:"2";}i:3;a:2:{s:2:"xx";s:14:"阿德雷可夫asdf";s:1:"k";s:1:"4";}}s:4:"daan";s:1:"2";s:5:"jieda";s:0:"";s:3:"fen";s:1:"2";s:2:"kf";s:1:"0";s:1:"k";s:3:"130";s:2:"th";s:1:"2";}}i:2;a:2:{i:131;a:9:{s:5:"title";s:9:"请选择134";s:3:"dsp";s:0:"";s:2:"xx";a:4:{i:0;a:2:{s:2:"xx";s:1:"1";s:1:"k";s:1:"1";}i:1;a:2:{s:2:"xx";s:1:"4";s:1:"k";s:1:"4";}i:2;a:2:{s:2:"xx";s:1:"3";s:1:"k";s:1:"3";}i:3;a:2:{s:2:"xx";s:1:"2";s:1:"k";s:1:"2";}}s:4:"daan";a:3:{i:0;s:1:"1";i:1;s:1:"3";i:2;s:1:"4";}s:5:"jieda";s:0:"";s:3:"fen";s:1:"2";s:2:"kf";s:1:"0";s:1:"k";s:3:"131";s:2:"th";s:1:"3";}i:132;a:9:{s:5:"title";s:8:"选择1234";s:3:"dsp";s:0:"";s:2:"xx";a:4:{i:0;a:2:{s:2:"xx";s:1:"3";s:1:"k";s:1:"3";}i:1;a:2:{s:2:"xx";s:1:"2";s:1:"k";s:1:"2";}i:2;a:2:{s:2:"xx";s:1:"4";s:1:"k";s:1:"4";}i:3;a:2:{s:2:"xx";s:1:"1";s:1:"k";s:1:"1";}}s:4:"daan";a:4:{i:0;s:1:"1";i:1;s:1:"2";i:2;s:1:"3";i:3;s:1:"4";}s:5:"jieda";s:0:"";s:3:"fen";s:1:"2";s:2:"kf";s:1:"0";s:1:"k";s:3:"132";s:2:"th";s:1:"4";}}i:7;a:1:{i:128;a:7:{s:5:"title";s:15:"<p>组合题型</p>";s:3:"dsp";s:0:"";s:4:"daan";s:0:"";s:5:"jieda";s:8:"暗室逢灯";s:1:"k";s:3:"128";s:2:"th";s:1:"5";s:3:"sun";s:0:"";}}}
//EOT;
//
//print_r(ExamUnserialize($str));
//print_r(GetTiKuLister(1,1));
//Iimport('dbsql');
//$db = new dbsql();
//$db -> SetQueryString("alsdfja'sdlfa'");
//$db -> ExecNoReturnSQL();
CreateMoneyCards(1,0,10);
?>